{
  "1.1. A Note on Terminology": "{\n    \"1.1. A Note on Terminology\": [\n        {\n            \"Original\": \"For the purpose of exposition, the original Internet-standard Network Management Framework, as described in RFCs 1155 (STD 16), 1157 (STD 15), and 1212 (STD 16), is termed the SNMP version 1 framework (SNMPv1).\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"The current framework is termed the SNMP version 2 framework (SNMPv2).\",\n            \"Adjusted\": \"No change\"\n        }\n    ]\n}",
  "2. Overview -> 2.6. Transport Mappings": "{\n    \"2. Overview -> 2.6. Transport Mappings\": [\n        {\n            \"Original\": \"It is important to note that the exchange of SNMPv2 messages requires only an unreliable datagram service, with every message being entirely and independently contained in a single transport datagram.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"Specific transport mappings and encoding rules are specified elsewhere [5\\\"\\\")].\",\n            \"Adjusted\": \"Specific transport mappings and encoding rules are specified elsewhere [5].\"\n        },\n        {\n            \"Original\": \"However, the preferred mapping is the use of the User Datagram Protocol [6].\",\n            \"Adjusted\": \"No change\"\n        }\n    ]\n}",
  "2. Overview -> 2.4. Retransmission of Requests": "{\n    \"2.4. Retransmission of Requests\": [\n        {\n            \"Original\": \"For all types of request in this protocol, the receiver is required under normal circumstances, to generate and transmit a response to the originator of the request.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"Whether or not a request should be retransmitted if no corresponding response is received in an appropriate time interval, is at the discretion of the application originating the request.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"This will normally depend on the urgency of the request.\",\n            \"Adjusted\": \"The decision to retransmit a request will normally depend on the urgency of the request.\"\n        },\n        {\n            \"Original\": \"However, such an application needs to act responsibly in respect to the frequency and duration of re-transmissions.\",\n            \"Adjusted\": \"However, the application originating the request needs to act responsibly in respect to the frequency and duration of retransmissions.\"\n        }\n    ]\n}",
  "2. Overview -> 2.2. Management Information": "{\n    \"2. Overview -> 2.2. Management Information\": [\n        {\n            \"Original\": \"The term, variable, refers to an instance of a non-aggregate object type defined according to the conventions set forth in the SMI [2\\\"\\\")] or the textual conventions based on the SMI [3\\\"\\\")].\",\n            \"Adjusted\": \"The term variable refers to an instance of a non-aggregate object type defined according to the conventions set forth in the SMI or the textual conventions based on the SMI.\"\n        },\n        {\n            \"Original\": \"The term, variable binding, normally refers to the pairing of the name of a variable and its associated value.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"However, if certain kinds of exceptional conditions occur during processing of a retrieval request, a variable binding will pair a name and an indication of that exception.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"A variable-binding list is a simple list of variable bindings.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"The name of a variable is an OBJECT IDENTIFIER which is the concatenation of the OBJECT IDENTIFIER of the corresponding object- type together with an OBJECT IDENTIFIER fragment identifying the instance.\",\n            \"Adjusted\": \"The name of a variable is an OBJECT IDENTIFIER which is the concatenation of the OBJECT IDENTIFIER of the corresponding object-type together with an OBJECT IDENTIFIER fragment identifying the instance.\"\n        },\n        {\n            \"Original\": \"The OBJECT IDENTIFIER of the corresponding object-type is called the OBJECT IDENTIFIER prefix of the variable.\",\n            \"Adjusted\": \"No change\"\n        }\n    ]\n}",
  "2. Overview -> 2.1. Roles of Protocol Entities": "{\n    \"2. Overview -> 2.1. Roles of Protocol Entities\": [\n        {\n            \"Original\": \"A SNMPv2 entity may operate in a manager role or an agent role.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"A SNMPv2 entity acts in an agent role when it performs SNMPv2 management operations in response to received SNMPv2 protocol messages (other than an inform notification) or when it sends trap notifications.\",\n            \"Adjusted\": \"A SNMPv2 entity acts in an agent role when the entity performs SNMPv2 management operations in response to received SNMPv2 protocol messages (other than an inform notification) or when the entity sends trap notifications.\"\n        },\n        {\n            \"Original\": \"A SNMPv2 entity acts in a manager role when it initiates SNMPv2 management operations by the generation of SNMPv2 protocol messages or when it performs SNMPv2 management operations in response to received trap or inform notifications.\",\n            \"Adjusted\": \"A SNMPv2 entity acts in a manager role when the entity initiates SNMPv2 management operations by the generation of SNMPv2 protocol messages or when the entity performs SNMPv2 management operations in response to received trap or inform notifications.\"\n        },\n        {\n            \"Original\": \"A SNMPv2 entity may support either or both roles, as dictated by its implementation and configuration.\",\n            \"Adjusted\": \"A SNMPv2 entity may support either or both roles, as dictated by the entity's implementation and configuration.\"\n        },\n        {\n            \"Original\": \"Further, a SNMPv2 entity can also act in the role of a proxy agent, in which it appears to be acting in an agent role, but satisfies management requests by acting in a manager role with a remote entity.\",\n            \"Adjusted\": \"Further, a SNMPv2 entity can also act in the role of a proxy agent, in which the entity appears to be acting in an agent role, but satisfies management requests by acting in a manager role with a remote entity.\"\n        }\n    ]\n}",
  "2. Overview -> 2.3. Access to Management Information": "{\n    \"2. Overview -> 2.3. Access to Management Information\": [\n        {\n            \"Original\": \"Three types of access to management information are provided by the protocol.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"One type is a request-response interaction, in which a SNMPv2 entity, acting in a manager role, sends a request to a SNMPv2 entity, acting in an agent role, and the latter SNMPv2 entity then responds to the request.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"This type is used to retrieve or modify management information associated with the managed device.\",\n            \"Adjusted\": \"This request-response interaction between manager and agent roles is used to retrieve or modify management information associated with the managed device.\"\n        },\n        {\n            \"Original\": \"A second type is also a request-response interaction, in which a SNMPv2 entity, acting in a manager role, sends a request to a SNMPv2 entity, also acting in a manager role, and the latter SNMPv2 entity then responds to the request.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"This type is used to notify a SNMPv2 entity, acting in a manager role, of management information associated with another SNMPv2 entity, also acting in a manager role.\",\n            \"Adjusted\": \"This request-response interaction between manager roles is used to notify a SNMPv2 entity, acting in a manager role, of management information associated with another SNMPv2 entity, also acting in a manager role.\"\n        },\n        {\n            \"Original\": \"The third type of access is an unconfirmed interaction, in which a SNMPv2 entity, acting in an agent role, sends a unsolicited message, termed a trap, to a SNMPv2 entity, acting in a manager role, and no response is returned.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"This type is used to notify a SNMPv2 entity, acting in a manager role, of an exceptional situation, which has resulted in changes to management information associated with the managed device.\",\n            \"Adjusted\": \"This unconfirmed interaction is used to notify a SNMPv2 entity, acting in a manager role, of an exceptional situation, which has resulted in changes to management information associated with the managed device.\"\n        }\n    ]\n}",
  "4. Protocol Specification -> 4.1. Common Constructs": "{\n    \"4. Protocol Specification -> 4.1. Common Constructs\": [\n        {\n            \"Original\": \"The value of the request-id field in a Response-PDU takes the value of the request-id field in the request PDU to which it is a response.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"By use of the request-id value, a SNMPv2 application can distinguish the (potentially multiple) outstanding requests, and thereby correlate incoming responses with outstanding requests.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"In cases where an unreliable datagram service is used, the request-id also provides a simple means of identifying messages duplicated by the network.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"Use of the same request-id on a retransmission of a request allows the response to either the original transmission or the retransmission to satisfy the request.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"However, in order to calculate the round trip time for transmission and processing of a request-response transaction, the SNMPv2 application needs to use a different request-id value on a retransmitted request.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"The latter strategy is recommended for use in the majority of situations.\",\n            \"Adjusted\": \"The strategy of using a different request-id value on retransmitted requests is recommended for use in the majority of situations.\"\n        },\n        {\n            \"Original\": \"A non-zero value of the error-status field in a Response-PDU is used to indicate that an exception occurred to prevent the processing of the request.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"In these cases, a non-zero value of the Response-PDU's error-index field provides additional information by identifying which variable binding in the list caused the exception.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"A variable binding is identified by its index value.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"The first variable binding in a variable-binding list is index one, the second is index two, etc.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"SNMPv2 limits OBJECT IDENTIFIER values to a maximum of 128 sub- identifiers, where each sub-identifier has a maximum value of 2**32- 1\\\\.\",\n            \"Adjusted\": \"SNMPv2 limits OBJECT IDENTIFIER values to a maximum of 128 sub-identifiers, where each sub-identifier has a maximum value of 2^32-1.\"\n        }\n    ]\n}",
  "4. Protocol Specification -> 4.2. PDU Processing": "{\n    \"4. Protocol Specification -> 4.2. PDU Processing\": [\n        {\n            \"Original\": \"It is mandatory that all SNMPv2 entities acting in an agent role be able to generate the following PDU types: Response-PDU and SNMPv2- Trap-PDU; further, all such implementations must be able to receive the following PDU types: GetRequest-PDU, GetNextRequest-PDU, GetBulkRequest-PDU, and SetRequest-PDU.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"It is mandatory that all SNMPv2 entities acting in a manager role be able to generate the following PDU types: GetRequest-PDU, GetNextRequest-PDU, GetBulkRequest-PDU, SetRequest-PDU, InformRequest-PDU, and Response-PDU; further, all such implementations must be able to receive the following PDU types: Response-PDU, SNMPv2-Trap-PDU, InformRequest-PDU; In the elements of procedure below, any field of a PDU which is not referenced by the relevant procedure is ignored by the receiving SNMPv2 entity.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"However, all components of a PDU, including those whose values are ignored by the receiving SNMPv2 entity, must have valid ASN.1 syntax and encoding.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"For example, some PDUs (e.g., the GetRequest-PDU) are concerned only with the name of a variable and not its value.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"In this case, the value portion of the variable binding is ignored by the receiving SNMPv2 entity.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"The unSpecified value is defined for use as the value portion of such bindings.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"On generating a management communication, the message \\\"wrapper\\\" to encapsulate the PDU is generated according to the \\\"Elements of Procedure\\\" of the administrative framework in use is followed.\",\n            \"Adjusted\": \"On generating a management communication, the message wrapper to encapsulate the PDU is generated according to the Elements of Procedure of the administrative framework in use.\"\n        },\n        {\n            \"Original\": \"While the definition of \\\"max-bindings\\\" does impose an upper-bound on the number of variable bindings, in practice, the size of a message is limited only by constraints on the maximum message size -- it is not limited by the number of variable bindings.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"On receiving a management communication, the \\\"Elements of Procedure\\\" of the administrative framework in use is followed, and if those procedures indicate that the operation contained within the message is to be performed locally, then those procedures also indicate the MIB view which is visible to the operation.\",\n            \"Adjusted\": \"On receiving a management communication, the Elements of Procedure of the administrative framework in use is followed, and if those procedures indicate that the operation contained within the message is to be performed locally, then those procedures also indicate the MIB view which is visible to the operation.\"\n        }\n    ]\n}",
  "2. Overview -> 2.5. Message Sizes": "{\n    \"2. Overview -> 2.5. Message Sizes\": [\n        {\n            \"Original\": \"The maximum size of a SNMPv2 message is limited to the minimum of: (1) the maximum message size which the destination SNMPv2 entity can accept; and, (2) the maximum message size which the source SNMPv2 entity can generate.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"The former may be known on a per-recipient basis; and in the absence of such knowledge, is indicated by transport domain used when sending the message.\",\n            \"Adjusted\": \"The maximum message size which the destination SNMPv2 entity can accept may be known on a per-recipient basis; and in the absence of such knowledge, is indicated by transport domain used when sending the message.\"\n        },\n        {\n            \"Original\": \"The latter is imposed by implementation-specific local constraints.\",\n            \"Adjusted\": \"The maximum message size which the source SNMPv2 entity can generate is imposed by implementation-specific local constraints.\"\n        },\n        {\n            \"Original\": \"Each transport mapping for the SNMPv2 indicates the minimum message size which a SNMPv2 implementation must be able to produce or consume.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"Although implementations are encouraged to support larger values whenever possible, a conformant implementation must never generate messages larger than allowed by the receiving SNMPv2 entity.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"One of the aims of the GetBulkRequest-PDU, specified in this protocol, is to minimize the number of protocol exchanges required to retrieve a large amount of management information.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"As such, this PDU type allows a SNMPv2 entity acting in a manager role to request that the response be as large as possible given the constraints on message sizes.\",\n            \"Adjusted\": \"As such, the GetBulkRequest-PDU type allows a SNMPv2 entity acting in a manager role to request that the response be as large as possible given the constraints on message sizes.\"\n        },\n        {\n            \"Original\": \"These constraints include the limits on the size of messages which the SNMPv2 entity acting in an agent role can generate, and the SNMPv2 entity acting in a manager role can receive.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"However, it is possible that such maximum sized messages may be larger than the Path MTU of the path across the network traversed by the messages.\",\n            \"Adjusted\": \"However, it is possible that maximum sized messages may be larger than the Path MTU of the path across the network traversed by the messages.\"\n        },\n        {\n            \"Original\": \"In this situation, such messages are subject to fragmentation.\",\n            \"Adjusted\": \"In this situation, messages larger than the Path MTU are subject to fragmentation.\"\n        },\n        {\n            \"Original\": \"Fragmentation is generally considered to be harmful [4], since among other problems, it leads to a decrease in the reliability of the transfer of the messages.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"Thus, a SNMPv2 entity which sends a GetBulkRequest-PDU must take care to set its parameters accordingly, so as to reduce the risk of fragmentation.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"In particular, under conditions of network stress, only small values should be used for max-repetitions.\",\n            \"Adjusted\": \"No change\"\n        }\n    ]\n}",
  "5. Security Considerations": "{\n    \"Security Considerations\": [\n        {\n            \"Original\": \"Security issues are not discussed in this memo.\",\n            \"Adjusted\": \"No change\"\n        }\n    ]\n}",
  "4. Protocol Specification -> 4.2. PDU Processing -> 4.2.4. The Response-PDU": "{\n    \"4.2.4. The Response-PDU\": [\n        {\n            \"Original\": \"The Response-PDU is generated by a SNMPv2 entity only upon receipt of a GetRequest-PDU, GetNextRequest-PDU, GetBulkRequest-PDU, SetRequest-PDU, or InformRequest-PDU, as described elsewhere in this document.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"If the error-status field of the Response-PDU is non-zero, the value fields of the variable bindings in the variable binding list are ignored.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"If both the error-status field and the error-index field of the Response-PDU are non-zero, then the value of the error-index field is the index of the variable binding (in the variable-binding list of the corresponding request) for which the request failed.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"The first variable binding in a request's variable-binding list is index one, the second is index two, etc.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"A compliant SNMPv2 entity acting in a manager role must be able to properly receive and handle a Response-PDU with an error-status field equal to `noSuchName', `badValue', or `readOnly'.\",\n            \"Adjusted\": \"A compliant SNMPv2 entity acting in a manager role must be able to properly receive and handle a Response-PDU with an error-status field equal to 'noSuchName', 'badValue', or 'readOnly'.\"\n        },\n        {\n            \"Original\": \"(See Section 3.1.2 of [8].) Upon receipt of a Response-PDU, the receiving SNMPv2 entity presents its contents to the SNMPv2 application which generated the request with the same request-id value.\",\n            \"Adjusted\": \"Upon receipt of a Response-PDU, the receiving SNMPv2 entity presents the Response-PDU contents to the SNMPv2 application which generated the request with the same request-id value. (See Section 3.1.2 of [8].)\"\n        }\n    ]\n}",
  "4. Protocol Specification -> 4.2. PDU Processing -> 4.2.6. The SNMPv2-Trap-PDU": "{\n    \"4. Protocol Specification -> 4.2. PDU Processing -> 4.2.6. The SNMPv2-Trap-PDU\": [\n        {\n            \"Original\": \"A SNMPv2-Trap-PDU is generated and transmitted by a SNMPv2 entity acting in an agent role when an exceptional situation occurs.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"The destination(s) to which a SNMPv2-Trap-PDU is sent is determined in an implementation-dependent fashion by the SNMPv2 entity.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"The first two variable bindings in the variable binding list of an SNMPv2-Trap-PDU are sysUpTime.0 [9\\\"\\\")] and snmpTrapOID.0 [9\\\"\\\")] respectively.\",\n            \"Adjusted\": \"The first two variable bindings in the variable binding list of an SNMPv2-Trap-PDU are sysUpTime.0 and snmpTrapOID.0 respectively.\"\n        },\n        {\n            \"Original\": \"If the OBJECTS clause is present in the invocation of the corresponding NOTIFICATION-TYPE macro, then each corresponding variable, as instantiated by this notification, is copied, in order, to the variable-bindings field.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"If any additional variables are being included (at the option of the generating SNMPv2 entity), then each is copied to the variable-bindings field.\",\n            \"Adjusted\": \"No change\"\n        }\n    ]\n}",
  "4. Protocol Specification -> 4.2. PDU Processing -> 4.2.1. The GetRequest-PDU": "{\n    \"4. Protocol Specification -> 4.2. PDU Processing -> 4.2.1. The GetRequest-PDU\": [\n        {\n            \"Original\": \"A GetRequest-PDU is generated and transmitted at the request of a SNMPv2 application.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"Upon receipt of a GetRequest-PDU, the receiving SNMPv2 entity processes each variable binding in the variable-binding list to produce a Response-PDU.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"All fields of the Response-PDU have the same values as the corresponding fields of the received request except as indicated below.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"Each variable binding is processed as follows: (1) If the variable binding's name exactly matches the name of a variable accessible by this request, then the variable binding's value field is set to the value of the named variable.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"(2) Otherwise, if the variable binding's name does not have an OBJECT IDENTIFIER prefix which exactly matches the OBJECT IDENTIFIER prefix of any (potential) variable accessible by this request, then its value field is set to `noSuchObject'.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"(3) Otherwise, the variable binding's value field is set to `noSuchInstance'.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"If the processing of any variable binding fails for a reason other than listed above, then the Response-PDU is re-formatted with the same values in its request-id and variable-bindings fields as the received GetRequest-PDU, with the value of its error-status field set to `genErr', and the value of its error-index field is set to the index of the failed variable binding.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"Otherwise, the value of the Response-PDU's error-status field is set to `noError', and the value of its error-index field is zero.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"The generated Response-PDU is then encapsulated into a message.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"If the size of the resultant message is less than or equal to both a local constraint and the maximum message size of the originator, it is transmitted to the originator of the GetRequest-PDU.\",\n            \"Adjusted\": \"If the size of the resultant message is less than or equal to both a local constraint and the maximum message size of the originator, the message is transmitted to the originator of the GetRequest-PDU.\"\n        },\n        {\n            \"Original\": \"Otherwise, an alternate Response-PDU is generated.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"This alternate Response-PDU is formatted with the same value in its request-id field as the received GetRequest-PDU, with the value of its error-status field set to `tooBig', the value of its error-index field set to zero, and an empty variable-bindings field.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"This alternate Response-PDU is then encapsulated into a message.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"If the size of the resultant message is less than or equal to both a local constraint and the maximum message size of the originator, it is transmitted to the originator of the GetRequest-PDU.\",\n            \"Adjusted\": \"If the size of the resultant message is less than or equal to both a local constraint and the maximum message size of the originator, the message is transmitted to the originator of the GetRequest-PDU.\"\n        },\n        {\n            \"Original\": \"Otherwise, the snmpSilentDrops [9\\\"\\\")] counter is incremented and the resultant message is discarded.\",\n            \"Adjusted\": \"Otherwise, the snmpSilentDrops counter is incremented and the resultant message is discarded.\"\n        }\n    ]\n}",
  "6. Editor's Address": "{\n    \"6. Editor's Address\": [\n        {\n            \"Original\": \"Keith McCloghrie Cisco Systems, Inc.\",\n            \"Adjusted\": \"Keith McCloghrie, Cisco Systems, Inc.\"\n        },\n        {\n            \"Original\": \"170 West Tasman Drive San Jose, CA 95134-1706 US Phone: +1 408 526 5260 EMail: kzm@cisco.com\",\n            \"Adjusted\": \"170 West Tasman Drive, San Jose, CA 95134-1706, US. Phone: +1 408 526 5260. Email: kzm@cisco.com\"\n        }\n    ]\n}",
  "4. Protocol Specification -> 4.2. PDU Processing -> 4.2.2. The GetNextRequest-PDU": "{\n    \"4. Protocol Specification -> 4.2. PDU Processing -> 4.2.2. The GetNextRequest-PDU\": [\n        {\n            \"Original\": \"A GetNextRequest-PDU is generated and transmitted at the request of a SNMPv2 application.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"Upon receipt of a GetNextRequest-PDU, the receiving SNMPv2 entity processes each variable binding in the variable-binding list to produce a Response-PDU.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"All fields of the Response-PDU have the same values as the corresponding fields of the received request except as indicated below.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"Each variable binding is processed as follows: (1) The variable is located which is in the lexicographically ordered list of the names of all variables which are accessible by this request and whose name is the first lexicographic successor of the variable binding's name in the incoming GetNextRequest-PDU.\",\n            \"Adjusted\": \"Each variable binding is processed as follows: (1) The variable is located which is in the lexicographically ordered list of the names of all variables accessible by this request and whose name is the first lexicographic successor of the variable binding's name in the incoming GetNextRequest-PDU.\"\n        },\n        {\n            \"Original\": \"The corresponding variable binding's name and value fields in the Response-PDU are set to the name and value of the located variable.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"(2) If the requested variable binding's name does not lexicographically precede the name of any variable accessible by this request, i.e., there is no lexicographic successor, then the corresponding variable binding produced in the Response-PDU has its value field set to `endOfMibView', and its name field set to the variable binding's name in the request.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"If the processing of any variable binding fails for a reason other than listed above, then the Response-PDU is re-formatted with the same values in its request-id and variable-bindings fields as the received GetNextRequest-PDU, with the value of its error-status field set to `genErr', and the value of its error-index field is set to the index of the failed variable binding.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"Otherwise, the value of the Response-PDU's error-status field is set to `noError', and the value of its error-index field is zero.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"The generated Response-PDU is then encapsulated into a message.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"If the size of the resultant message is less than or equal to both a local constraint and the maximum message size of the originator, it is transmitted to the originator of the GetNextRequest-PDU.\",\n            \"Adjusted\": \"If the size of the resultant message is less than or equal to both a local constraint and the maximum message size of the originator, the message is transmitted to the originator of the GetNextRequest-PDU.\"\n        },\n        {\n            \"Original\": \"Otherwise, an alternate Response-PDU is generated.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"This alternate Response-PDU is formatted with the same values in its request-id field as the received GetNextRequest-PDU, with the value of its error-status field set to `tooBig', the value of its error-index field set to zero, and an empty variable-bindings field.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"This alternate Response-PDU is then encapsulated into a message.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"If the size of the resultant message is less than or equal to both a local constraint and the maximum message size of the originator, it is transmitted to the originator of the GetNextRequest-PDU.\",\n            \"Adjusted\": \"If the size of the resultant message is less than or equal to both a local constraint and the maximum message size of the originator, the message is transmitted to the originator of the GetNextRequest-PDU.\"\n        },\n        {\n            \"Original\": \"Otherwise, the snmpSilentDrops [9\\\"\\\")] counter is incremented and the resultant message is discarded.\",\n            \"Adjusted\": \"Otherwise, the snmpSilentDrops counter is incremented and the resultant message is discarded.\"\n        }\n    ]\n}",
  "3. Definitions": "{\n    \"3. Definitions\": [\n        {\n            \"Original\": \"SNMPv2-PDU DEFINITIONS ::= BEGIN IMPORTS ObjectName, ObjectSyntax, Integer32 FROM SNMPv2-SMI; \\\\-- protocol data units PDUs ::= CHOICE { get-request GetRequest-PDU, get-next-request GetNextRequest-PDU, get-bulk-request GetBulkRequest-PDU, response Response-PDU, set-request SetRequest-PDU, inform-request InformRequest-PDU, snmpV2-trap SNMPv2-Trap-PDU, report Report-PDU, } \\\\-- PDUs GetRequest-PDU ::= [0] IMPLICIT PDU GetNextRequest-PDU ::= [1] IMPLICIT PDU Response-PDU ::= [2\\\"\\\")] IMPLICIT PDU SetRequest-PDU ::= [3\\\"\\\")] IMPLICIT PDU \\\\-- [4] is obsolete GetBulkRequest-PDU ::= [5\\\"\\\")] IMPLICIT BulkPDU InformRequest-PDU ::= [6] IMPLICIT PDU SNMPv2-Trap-PDU ::= [7] IMPLICIT PDU \\\\-- Usage and precise semantics of Report-PDU are not presently \\\\-- defined.\",\n            \"Adjusted\": \"SNMPv2-PDU definitions begin with imports of ObjectName, ObjectSyntax, and Integer32 from SNMPv2-SMI. Protocol data units (PDUs) are defined as a choice of get-request GetRequest-PDU, get-next-request GetNextRequest-PDU, get-bulk-request GetBulkRequest-PDU, response Response-PDU, set-request SetRequest-PDU, inform-request InformRequest-PDU, snmpV2-trap SNMPv2-Trap-PDU, and report Report-PDU. GetRequest-PDU is defined as [0] IMPLICIT PDU, GetNextRequest-PDU as [1] IMPLICIT PDU, Response-PDU as [2] IMPLICIT PDU, SetRequest-PDU as [3] IMPLICIT PDU, GetBulkRequest-PDU as [5] IMPLICIT BulkPDU, InformRequest-PDU as [6] IMPLICIT PDU, and SNMPv2-Trap-PDU as [7] IMPLICIT PDU. The usage and precise semantics of Report-PDU are not presently defined.\"\n        },\n        {\n            \"Original\": \"Any SNMP administrative framework making use of \\\\-- this PDU must define its usage and semantics.\",\n            \"Adjusted\": \"Any SNMP administrative framework making use of the Report-PDU must define its usage and semantics.\"\n        },\n        {\n            \"Original\": \"Report-PDU ::= [8] IMPLICIT PDU max-bindings INTEGER ::= 2147483647 PDU ::= SEQUENCE { request-id Integer32, error-status -- sometimes ignored INTEGER { noError(0), tooBig(1), noSuchName(2), -- for proxy compatibility badValue(3), -- for proxy compatibility readOnly(4), -- for proxy compatibility genErr(5), noAccess(6), wrongType(7), wrongLength(8), wrongEncoding(9), wrongValue(10), noCreation(11), inconsistentValue(12), resourceUnavailable(13), commitFailed(14), undoFailed(15), authorizationError(16), notWritable(17), inconsistentName(18) }, error-index -- sometimes ignored INTEGER (0..max-bindings), variable-bindings -- values are sometimes ignored VarBindList } BulkPDU ::= -- MUST be identical in SEQUENCE { -- structure to PDU request-id Integer32, non-repeaters INTEGER (0..max-bindings), max-repetitions INTEGER (0..max-bindings), variable-bindings -- values are ignored VarBindList } \\\\-- variable binding VarBind ::= SEQUENCE { name ObjectName, CHOICE { value ObjectSyntax, unSpecified -- in retrieval requests NULL, \\\\-- exceptions in responses noSuchObject[0] IMPLICIT NULL, noSuchInstance[1] IMPLICIT NULL, endOfMibView[2] IMPLICIT NULL } } \\\\-- variable-binding list VarBindList ::= SEQUENCE (SIZE (0..max-bindings)) OF VarBind END\",\n            \"Adjusted\": \"Report-PDU is defined as [8] IMPLICIT PDU. max-bindings INTEGER is defined as 2147483647. PDU is defined as a sequence containing request-id Integer32, error-status INTEGER with values noError(0), tooBig(1), noSuchName(2), badValue(3), readOnly(4), genErr(5), noAccess(6), wrongType(7), wrongLength(8), wrongEncoding(9), wrongValue(10), noCreation(11), inconsistentValue(12), resourceUnavailable(13), commitFailed(14), undoFailed(15), authorizationError(16), notWritable(17), inconsistentName(18), error-index INTEGER (0..max-bindings), and variable-bindings VarBindList. BulkPDU is defined as a sequence containing request-id Integer32, non-repeaters INTEGER (0..max-bindings), max-repetitions INTEGER (0..max-bindings), and variable-bindings VarBindList. VarBind is defined as a sequence containing name ObjectName and a choice of value ObjectSyntax, unSpecified NULL, noSuchObject[0] IMPLICIT NULL, noSuchInstance[1] IMPLICIT NULL, or endOfMibView[2] IMPLICIT NULL. VarBindList is defined as a sequence of size (0..max-bindings) of VarBind.\"\n        }\n    ]\n}",
  "4. Protocol Specification -> 4.2. PDU Processing -> 4.2.3. The GetBulkRequest-PDU -> 4.2.3.1. Another Example of Table Traversal": "{\n    \"4. Protocol Specification -> 4.2. PDU Processing -> 4.2.3. The GetBulkRequest-PDU -> 4.2.3.1. Another Example of Table Traversal\": [\n        {\n            \"Original\": \"This example demonstrates how the GetBulkRequest-PDU can be used as an alternative to the GetNextRequest-PDU.\",\n            \"Adjusted\": \"This example demonstrates how the GetBulkRequest-PDU can be used as an alternative to the GetNextRequest-PDU.\"\n        },\n        {\n            \"Original\": \"The same traversal of the IP net-to-media table as shown inSection 4.2.2.1 is achieved with fewer exchanges.\",\n            \"Adjusted\": \"The same traversal of the IP net-to-media table as shown in Section 4.2.2.1 is achieved with fewer exchanges.\"\n        },\n        {\n            \"Original\": \"The SNMPv2 entity acting in a manager role begins by sending a GetBulkRequest-PDU with the modest max-repetitions value of 2, and containing the indicated OBJECT IDENTIFIER values as the requested variable names: GetBulkRequest [ non-repeaters = 1, max-repetitions = 2 ] ( sysUpTime, ipNetToMediaPhysAddress, ipNetToMediaType ) The SNMPv2 entity acting in an agent role responds with a Response-PDU: Response (( sysUpTime.0 = \\\"123456\\\" ), ( ipNetToMediaPhysAddress.1.9.2.3.4 = \\\"000010543210\\\" ), ( ipNetToMediaType.1.9.2.3.4 = \\\"dynamic\\\" ), ( ipNetToMediaPhysAddress.1.10.0.0.51 = \\\"000010012345\\\" ), ( ipNetToMediaType.1.10.0.0.51 = \\\"static\\\" )) The SNMPv2 entity acting in a manager role continues with: GetBulkRequest [ non-repeaters = 1, max-repetitions = 2 ] ( sysUpTime, ipNetToMediaPhysAddress.1.10.0.0.51, ipNetToMediaType.1.10.0.0.51 ) The SNMPv2 entity acting in an agent role responds with: Response (( sysUpTime.0 = \\\"123466\\\" ), ( ipNetToMediaPhysAddress.2.10.0.0.15 = \\\"000010987654\\\" ), ( ipNetToMediaType.2.10.0.0.15 = \\\"dynamic\\\" ), ( ipNetToMediaNetAddress.1.9.2.3.4 = \\\"9.2.3.4\\\" ), ( ipRoutingDiscards.0 = \\\"2\\\" )) This response signals the end of the table to the SNMPv2 entity acting in a manager role.\",\n            \"Adjusted\": \"The SNMPv2 entity acting in a manager role begins by sending a GetBulkRequest-PDU with the modest max-repetitions value of 2, and containing the indicated OBJECT IDENTIFIER values as the requested variable names: GetBulkRequest [ non-repeaters = 1, max-repetitions = 2 ] ( sysUpTime, ipNetToMediaPhysAddress, ipNetToMediaType ). The SNMPv2 entity acting in an agent role responds with a Response-PDU: Response (( sysUpTime.0 = \\\"123456\\\" ), ( ipNetToMediaPhysAddress.1.9.2.3.4 = \\\"000010543210\\\" ), ( ipNetToMediaType.1.9.2.3.4 = \\\"dynamic\\\" ), ( ipNetToMediaPhysAddress.1.10.0.0.51 = \\\"000010012345\\\" ), ( ipNetToMediaType.1.10.0.0.51 = \\\"static\\\" )). The SNMPv2 entity acting in a manager role continues with: GetBulkRequest [ non-repeaters = 1, max-repetitions = 2 ] ( sysUpTime, ipNetToMediaPhysAddress.1.10.0.0.51, ipNetToMediaType.1.10.0.0.51 ). The SNMPv2 entity acting in an agent role responds with: Response (( sysUpTime.0 = \\\"123466\\\" ), ( ipNetToMediaPhysAddress.2.10.0.0.15 = \\\"000010987654\\\" ), ( ipNetToMediaType.2.10.0.0.15 = \\\"dynamic\\\" ), ( ipNetToMediaNetAddress.1.9.2.3.4 = \\\"9.2.3.4\\\" ), ( ipRoutingDiscards.0 = \\\"2\\\" )). This response signals the end of the table to the SNMPv2 entity acting in a manager role.\"\n        }\n    ]\n}",
  "4. Protocol Specification -> 4.2. PDU Processing -> 4.2.2. The GetNextRequest-PDU -> 4.2.2.1. Example of Table Traversal": "{\n    \"4. Protocol Specification -> 4.2. PDU Processing -> 4.2.2. The GetNextRequest-PDU -> 4.2.2.1. Example of Table Traversal\": [\n        {\n            \"Original\": \"An important use of the GetNextRequest-PDU is the traversal of conceptual tables of information within a MIB.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"The semantics of this type of request, together with the method of identifying individual instances of objects in the MIB, provides access to related objects in the MIB as if they enjoyed a tabular organization.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"In the protocol exchange sketched below, a SNMPv2 application retrieves the media-dependent physical address and the address- mapping type for each entry in the IP net-to-media Address Translation Table [7] of a particular network element.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"It also retrieves the value of sysUpTime [9\\\"\\\")], at which the mappings existed.\",\n            \"Adjusted\": \"The SNMPv2 application also retrieves the value of sysUpTime, at which the mappings existed.\"\n        },\n        {\n            \"Original\": \"Suppose that the agent's IP net-to-media table has three entries: Interface-Number Network-Address Physical-Address Type 1 10.0.0.51 00:00:10:01:23:45 static 1 9.2.3.4 00:00:10:54:32:10 dynamic 2 10.0.0.15 00:00:10:98:76:54 dynamic The SNMPv2 entity acting in a manager role begins by sending a GetNextRequest-PDU containing the indicated OBJECT IDENTIFIER values as the requested variable names: GetNextRequest ( sysUpTime, ipNetToMediaPhysAddress, ipNetToMediaType ) The SNMPv2 entity acting in an agent role responds with a Response- PDU: Response (( sysUpTime.0 = \\\"123456\\\" ), ( ipNetToMediaPhysAddress.1.9.2.3.4 = \\\"000010543210\\\" ), ( ipNetToMediaType.1.9.2.3.4 = \\\"dynamic\\\" )) The SNMPv2 entity acting in a manager role continues with: GetNextRequest ( sysUpTime, ipNetToMediaPhysAddress.1.9.2.3.4, ipNetToMediaType.1.9.2.3.4 ) The SNMPv2 entity acting in an agent role responds with: Response (( sysUpTime.0 = \\\"123461\\\" ), ( ipNetToMediaPhysAddress.1.10.0.0.51 = \\\"000010012345\\\" ), ( ipNetToMediaType.1.10.0.0.51 = \\\"static\\\" )) The SNMPv2 entity acting in a manager role continues with: GetNextRequest ( sysUpTime, ipNetToMediaPhysAddress.1.10.0.0.51, ipNetToMediaType.1.10.0.0.51 ) The SNMPv2 entity acting in an agent role responds with: Response (( sysUpTime.0 = \\\"123466\\\" ), ( ipNetToMediaPhysAddress.2.10.0.0.15 = \\\"000010987654\\\" ), ( ipNetToMediaType.2.10.0.0.15 = \\\"dynamic\\\" )) The SNMPv2 entity acting in a manager role continues with: GetNextRequest ( sysUpTime, ipNetToMediaPhysAddress.2.10.0.0.15, ipNetToMediaType.2.10.0.0.15 ) As there are no further entries in the table, the SNMPv2 entity acting in an agent role responds with the variables that are next in the lexicographical ordering of the accessible object names, for example: Response (( sysUpTime.0 = \\\"123471\\\" ), ( ipNetToMediaNetAddress.1.9.2.3.4 = \\\"9.2.3.4\\\" ), ( ipRoutingDiscards.0 = \\\"2\\\" )) This response signals the end of the table to the SNMPv2 entity acting in a manager role.\",\n            \"Adjusted\": \"Suppose that the agent's IP net-to-media table has three entries. The SNMPv2 entity acting in a manager role begins by sending a GetNextRequest-PDU containing the indicated OBJECT IDENTIFIER values as the requested variable names. The SNMPv2 entity acting in an agent role responds with a Response-PDU. The SNMPv2 entity acting in a manager role continues with another GetNextRequest. The SNMPv2 entity acting in an agent role responds again. The SNMPv2 entity acting in a manager role continues with another GetNextRequest. The SNMPv2 entity acting in an agent role responds again. The SNMPv2 entity acting in a manager role continues with another GetNextRequest. As there are no further entries in the table, the SNMPv2 entity acting in an agent role responds with the variables that are next in the lexicographical ordering of the accessible object names. This response signals the end of the table to the SNMPv2 entity acting in a manager role.\"\n        }\n    ]\n}",
  "4. Protocol Specification -> 4.2. PDU Processing -> 4.2.7. The InformRequest-PDU": "{\n    \"4. Protocol Specification -> 4.2. PDU Processing -> 4.2.7. The InformRequest-PDU\": [\n        {\n            \"Original\": \"An InformRequest-PDU is generated and transmitted at the request of an application in a SNMPv2 entity acting in a manager role, that wishes to notify another application (in a SNMPv2 entity also acting in a manager role) of information in a MIB view which is remote to the receiving application.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"The destination(s) to which an InformRequest-PDU is sent is specified by the requesting application.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"The first two variable bindings in the variable binding list of an InformRequest-PDU are sysUpTime.0 [9\\\"\\\")] and snmpTrapOID.0 [9\\\"\\\")] respectively.\",\n            \"Adjusted\": \"The first two variable bindings in the variable binding list of an InformRequest-PDU are sysUpTime.0 and snmpTrapOID.0 respectively.\"\n        },\n        {\n            \"Original\": \"If the OBJECTS clause is present in the invocation of the corresponding NOTIFICATION-TYPE macro, then each corresponding variable, as instantiated by this notification, is copied, in order, to the variable-bindings field.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"Upon receipt of an InformRequest-PDU, the receiving SNMPv2 entity determines the size of a message encapsulating a Response-PDU with the same values in its request-id, error-status, error-index and variable-bindings fields as the received InformRequest-PDU.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"If the determined message size is greater than either a local constraint or the maximum message size of the originator, then an alternate Response-PDU is generated, transmitted to the originator of the InformRequest-PDU, and processing of the InformRequest-PDU terminates immediately thereafter.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"This alternate Response-PDU is formatted with the same values in its request-id field as the received InformRequest-PDU, with the value of its error-status field set to `tooBig', the value of its error-index field set to zero, and an empty variable-bindings field.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"This alternate Response-PDU is then encapsulated into a message.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"If the size of the resultant message is less than or equal to both a local constraint and the maximum message size of the originator, it is transmitted to the originator of the InformRequest-PDU.\",\n            \"Adjusted\": \"If the size of the resultant message is less than or equal to both a local constraint and the maximum message size of the originator, the message is transmitted to the originator of the InformRequest-PDU.\"\n        },\n        {\n            \"Original\": \"Otherwise, the snmpSilentDrops [9\\\"\\\")] counter is incremented and the resultant message is discarded.\",\n            \"Adjusted\": \"Otherwise, the snmpSilentDrops counter is incremented and the resultant message is discarded.\"\n        },\n        {\n            \"Original\": \"Regardless, processing of the InformRequest-PDU terminates.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"Otherwise, the receiving SNMPv2 entity: (1) presents its contents to the appropriate SNMPv2 application; (2) generates a Response-PDU with the same values in its request-id and variable-bindings fields as the received InformRequest-PDU, with the value of its error-status field is set to `noError' and the value of its error-index field is zero; and (3) transmits the generated Response-PDU to the originator of the InformRequest-PDU.\",\n            \"Adjusted\": \"Otherwise, the receiving SNMPv2 entity: (1) presents the InformRequest-PDU contents to the appropriate SNMPv2 application; (2) generates a Response-PDU with the same values in its request-id and variable-bindings fields as the received InformRequest-PDU, with the value of its error-status field set to 'noError' and the value of its error-index field set to zero; and (3) transmits the generated Response-PDU to the originator of the InformRequest-PDU.\"\n        }\n    ]\n}",
  "7. Acknowledgements": "{\n    \"Acknowledgements\": [\n        {\n            \"Original\": \"This document is the result of significant work by the four major contributors: Jeffrey D.\",\n            \"Adjusted\": \"This document is the result of significant work by the four major contributors: Jeffrey D.\"\n        },\n        {\n            \"Original\": \"Case (SNMP Research, case@snmp.com) Keith McCloghrie (Cisco Systems, kzm@cisco.com) Marshall T.\",\n            \"Adjusted\": \"Case (SNMP Research, case@snmp.com) Keith McCloghrie (Cisco Systems, kzm@cisco.com) Marshall T.\"\n        },\n        {\n            \"Original\": \"Rose (Dover Beach Consulting, mrose@dbc.mtview.ca.us) Steven Waldbusser (International Network Services, stevew@uni.ins.com) In addition, the contributions of the SNMPv2 Working Group are acknowledged.\",\n            \"Adjusted\": \"Rose (Dover Beach Consulting, mrose@dbc.mtview.ca.us) Steven Waldbusser (International Network Services, stevew@uni.ins.com) In addition, the contributions of the SNMPv2 Working Group are acknowledged.\"\n        },\n        {\n            \"Original\": \"In particular, a special thanks is extended for the contributions of: Alexander I.\",\n            \"Adjusted\": \"In particular, a special thanks is extended for the contributions of: Alexander I.\"\n        },\n        {\n            \"Original\": \"Alten (Novell) Dave Arneson (Cabletron) Uri Blumenthal (IBM) Doug Book (Chipcom) Kim Curran (Bell-Northern Research) Jim Galvin (Trusted Information Systems) Maria Greene (Ascom Timeplex) Iain Hanson (Digital) Dave Harrington (Cabletron) Nguyen Hien (IBM) Jeff Johnson (Cisco Systems) Michael Kornegay (Object Quest) Deirdre Kostick (AT&T Bell Labs) David Levi (SNMP Research) Daniel Mahoney (Cabletron) Bob Natale (ACE*COMM) Brian O'Keefe (Hewlett Packard) Andrew Pearson (SNMP Research) Dave Perkins (Peer Networks) Randy Presuhn (Peer Networks) Aleksey Romanov (Quality Quorum) Shawn Routhier (Epilogue) Jon Saperia (BGS Systems) Bob Stewart (Cisco Systems, bstewart@cisco.com), chair Kaj Tesink (Bellcore) Glenn Waters (Bell-Northern Research) Bert Wijnen (IBM)\",\n            \"Adjusted\": \"Alten (Novell) Dave Arneson (Cabletron) Uri Blumenthal (IBM) Doug Book (Chipcom) Kim Curran (Bell-Northern Research) Jim Galvin (Trusted Information Systems) Maria Greene (Ascom Timeplex) Iain Hanson (Digital) Dave Harrington (Cabletron) Nguyen Hien (IBM) Jeff Johnson (Cisco Systems) Michael Kornegay (Object Quest) Deirdre Kostick (AT&T Bell Labs) David Levi (SNMP Research) Daniel Mahoney (Cabletron) Bob Natale (ACE*COMM) Brian O'Keefe (Hewlett Packard) Andrew Pearson (SNMP Research) Dave Perkins (Peer Networks) Randy Presuhn (Peer Networks) Aleksey Romanov (Quality Quorum) Shawn Routhier (Epilogue) Jon Saperia (BGS Systems) Bob Stewart (Cisco Systems, bstewart@cisco.com), chair Kaj Tesink (Bellcore) Glenn Waters (Bell-Northern Research) Bert Wijnen (IBM)\"\n        }\n    ]\n}",
  "4. Protocol Specification -> 4.2. PDU Processing -> 4.2.3. The GetBulkRequest-PDU": "{\n    \"4. Protocol Specification -> 4.2. PDU Processing -> 4.2.3. The GetBulkRequest-PDU\": [\n        {\n            \"Original\": \"A GetBulkRequest-PDU is generated and transmitted at the request of a SNMPv2 application.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"The purpose of the GetBulkRequest-PDU is to request the transfer of a potentially large amount of data, including, but not limited to, the efficient and rapid retrieval of large tables.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"Upon receipt of a GetBulkRequest-PDU, the receiving SNMPv2 entity processes each variable binding in the variable-binding list to produce a Response-PDU with its request-id field having the same value as in the request.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"Processing begins by examining the values in the non-repeaters and max-repetitions fields.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"If the value in the non-repeaters field is less than zero, then the value of the field is set to zero.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"Similarly, if the value in the max-repetitions field is less than zero, then the value of the field is set to zero.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"For the GetBulkRequest-PDU type, the successful processing of each variable binding in the request generates zero or more variable bindings in the Response-PDU.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"That is, the one-to-one mapping between the variable bindings of the GetRequest-PDU, GetNextRequest- PDU, and SetRequest-PDU types and the resultant Response-PDUs does not apply for the mapping between the variable bindings of a GetBulkRequest-PDU and the resultant Response-PDU.\",\n            \"Adjusted\": \"That is, the one-to-one mapping between the variable bindings of the GetRequest-PDU, GetNextRequest-PDU, and SetRequest-PDU types and the resultant Response-PDUs does not apply for the mapping between the variable bindings of a GetBulkRequest-PDU and the resultant Response-PDU.\"\n        },\n        {\n            \"Original\": \"The values of the non-repeaters and max-repetitions fields in the request specify the processing requested.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"One variable binding in the Response-PDU is requested for the first N variable bindings in the request and M variable bindings are requested for each of the R remaining variable bindings in the request.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"Consequently, the total number of requested variable bindings communicated by the request is given by N + (M * R), where N is the minimum of: a) the value of the non-repeaters field in the request, and b) the number of variable bindings in the request; M is the value of the max-repetitions field in the request; and R is the maximum of: a) number of variable bindings in the request - N, and b) zero.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"The receiving SNMPv2 entity produces a Response-PDU with up to the total number of requested variable bindings communicated by the request.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"The request-id shall have the same value as the received GetBulkRequest-PDU.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"If N is greater than zero, the first through the (N)-th variable bindings of the Response-PDU are each produced as follows: (1) The variable is located which is in the lexicographically ordered list of the names of all variables which are accessible by this request and whose name is the first lexicographic successor of the variable binding's name in the incoming GetBulkRequest-PDU.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"The corresponding variable binding's name and value fields in the Response-PDU are set to the name and value of the located variable.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"(2) If the requested variable binding's name does not lexicographically precede the name of any variable accessible by this request, i.e., there is no lexicographic successor, then the corresponding variable binding produced in the Response-PDU has its value field set to `endOfMibView', and its name field set to the variable binding's name in the request.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"If M and R are non-zero, the (N + 1)-th and subsequent variable bindings of the Response-PDU are each produced in a similar manner.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"For each iteration i, such that i is greater than zero and less than or equal to M, and for each repeated variable, r, such that r is greater than zero and less than or equal to R, the (N + ( (i-1) * R ) \\\\+ r)-th variable binding of the Response-PDU is produced as follows: (1) The variable which is in the lexicographically ordered list of the names of all variables which are accessible by this request and whose name is the (i)-th lexicographic successor of the (N + r)-th variable binding's name in the incoming GetBulkRequest-PDU is located and the variable binding's name and value fields are set to the name and value of the located variable.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"(2) If there is no (i)-th lexicographic successor, then the corresponding variable binding produced in the Response-PDU has its value field set to `endOfMibView', and its name field set to either the last lexicographic successor, or if there are no lexicographic successors, to the (N + r)-th variable binding's name in the request.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"While the maximum number of variable bindings in the Response-PDU is bounded by N + (M * R), the response may be generated with a lesser number of variable bindings (possibly zero) for either of three reasons.\",\n            \"Adjusted\": \"While the maximum number of variable bindings in the Response-PDU is bounded by N + (M * R), the response may be generated with a lesser number of variable bindings (possibly zero) for any of three reasons.\"\n        },\n        {\n            \"Original\": \"(1) If the size of the message encapsulating the Response-PDU containing the requested number of variable bindings would be greater than either a local constraint or the maximum message size of the originator, then the response is generated with a lesser number of variable bindings.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"This lesser number is the ordered set of variable bindings with some of the variable bindings at the end of the set removed, such that the size of the message encapsulating the Response-PDU is approximately equal to but no greater than either a local constraint or the maximum message size of the originator.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"Note that the number of variable bindings removed has no relationship to the values of N, M, or R.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"(2) The response may also be generated with a lesser number of variable bindings if for some value of iteration i, such that i is greater than zero and less than or equal to M, that all of the generated variable bindings have the value field set to the `endOfMibView'.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"In this case, the variable bindings may be truncated after the (N + (i * R))-th variable binding.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"(3) In the event that the processing of a request with many repetitions requires a significantly greater amount of processing time than a normal request, then an agent may terminate the request with less than the full number of repetitions, providing at least one repetition is completed.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"If the processing of any variable binding fails for a reason other than listed above, then the Response-PDU is re-formatted with the same values in its request-id and variable-bindings fields as the received GetBulkRequest-PDU, with the value of its error-status field set to `genErr', and the value of its error-index field is set to the index of the variable binding in the original request which corresponds to the failed variable binding.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"Otherwise, the value of the Response-PDU's error-status field is set to `noError', and the value of its error-index field to zero.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"The generated Response-PDU (possibly with an empty variable-bindings field) is then encapsulated into a message.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"If the size of the resultant message is less than or equal to both a local constraint and the maximum message size of the originator, it is transmitted to the originator of the GetBulkRequest-PDU.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"Otherwise, the snmpSilentDrops [9\\\"\\\")] counter is incremented and the resultant message is discarded.\",\n            \"Adjusted\": \"Otherwise, the snmpSilentDrops counter is incremented and the resultant message is discarded.\"\n        }\n    ]\n}",
  "4. Protocol Specification -> 4.2. PDU Processing -> 4.2.5. The SetRequest-PDU": "{\n    \"4. Protocol Specification -> 4.2. PDU Processing -> 4.2.5. The SetRequest-PDU\": [\n        {\n            \"Original\": \"A SetRequest-PDU is generated and transmitted at the request of a SNMPv2 application.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"Upon receipt of a SetRequest-PDU, the receiving SNMPv2 entity determines the size of a message encapsulating a Response-PDU having the same values in its request-id and variable-bindings fields as the received SetRequest-PDU, and the largest possible sizes of the error-status and error-index fields.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"If the determined message size is greater than either a local constraint or the maximum message size of the originator, then an alternate Response-PDU is generated, transmitted to the originator of the SetRequest-PDU, and processing of the SetRequest-PDU terminates immediately thereafter.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"This alternate Response-PDU is formatted with the same values in its request-id field as the received SetRequest-PDU, with the value of its error-status field set to `tooBig', the value of its error-index field set to zero, and an empty variable-bindings field.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"This alternate Response-PDU is then encapsulated into a message.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"If the size of the resultant message is less than or equal to both a local constraint and the maximum message size of the originator, it is transmitted to the originator of the SetRequest-PDU.\",\n            \"Adjusted\": \"If the size of the resultant message is less than or equal to both a local constraint and the maximum message size of the originator, the message is transmitted to the originator of the SetRequest-PDU.\"\n        },\n        {\n            \"Original\": \"Otherwise, the snmpSilentDrops [9\\\"\\\")] counter is incremented and the resultant message is discarded.\",\n            \"Adjusted\": \"Otherwise, the snmpSilentDrops counter is incremented and the resultant message is discarded.\"\n        },\n        {\n            \"Original\": \"Regardless, processing of the SetRequest-PDU terminates.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"Otherwise, the receiving SNMPv2 entity processes each variable binding in the variable-binding list to produce a Response-PDU.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"All fields of the Response-PDU have the same values as the corresponding fields of the received request except as indicated below.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"The variable bindings are conceptually processed as a two phase operation.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"In the first phase, each variable binding is validated; if all validations are successful, then each variable is altered in the second phase.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"Of course, implementors are at liberty to implement either the first, or second, or both, of these conceptual phases as multiple implementation phases.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"Indeed, such multiple implementation phases may be necessary in some cases to ensure consistency.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"The following validations are performed in the first phase on each variable binding until they are all successful, or until one fails: (1) If the variable binding's name specifies an existing or non- existent variable to which this request is/would be denied access because it is/would not be in the appropriate MIB view, then the value of the Response-PDU's error-status field is set to `noAccess', and the value of its error-index field is set to the index of the failed variable binding.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"(2) Otherwise, if there are no variables which share the same OBJECT IDENTIFIER prefix as the variable binding's name, and which are able to be created or modified no matter what new value is specified, then the value of the Response-PDU's error-status field is set to `notWritable', and the value of its error-index field is set to the index of the failed variable binding.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"(3) Otherwise, if the variable binding's value field specifies, according to the ASN.1 language, a type which is inconsistent with that required for all variables which share the same OBJECT IDENTIFIER prefix as the variable binding's name, then the value of the Response-PDU's error-status field is set to `wrongType', and the value of its error-index field is set to the index of the failed variable binding.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"(4) Otherwise, if the variable binding's value field specifies, according to the ASN.1 language, a length which is inconsistent with that required for all variables which share the same OBJECT IDENTIFIER prefix as the variable binding's name, then the value of the Response-PDU's error-status field is set to `wrongLength', and the value of its error-index field is set to the index of the failed variable binding.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"(5) Otherwise, if the variable binding's value field contains an ASN.1 encoding which is inconsistent with that field's ASN.1 tag, then the value of the Response-PDU's error-status field is set to `wrongEncoding', and the value of its error-index field is set to the index of the failed variable binding.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"(Note that not all implementation strategies will generate this error.) (6) Otherwise, if the variable binding's value field specifies a value which could under no circumstances be assigned to the variable, then the value of the Response-PDU's error-status field is set to `wrongValue', and the value of its error-index field is set to the index of the failed variable binding.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"(7) Otherwise, if the variable binding's name specifies a variable which does not exist and could not ever be created (even though some variables sharing the same OBJECT IDENTIFIER prefix might under some circumstances be able to be created), then the value of the Response-PDU's error-status field is set to `noCreation', and the value of its error-index field is set to the index of the failed variable binding.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"(8) Otherwise, if the variable binding's name specifies a variable which does not exist but can not be created under the present circumstances (even though it could be created under other circumstances), then the value of the Response-PDU's error-status field is set to `inconsistentName', and the value of its error- index field is set to the index of the failed variable binding.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"(9) Otherwise, if the variable binding's name specifies a variable which exists but can not be modified no matter what new value is specified, then the value of the Response-PDU's error-status field is set to `notWritable', and the value of its error-index field is set to the index of the failed variable binding.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"(10) Otherwise, if the variable binding's value field specifies a value that could under other circumstances be held by the variable, but is presently inconsistent or otherwise unable to be assigned to the variable, then the value of the Response-PDU's error-status field is set to `inconsistentValue', and the value of its error-index field is set to the index of the failed variable binding.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"(11) When, during the above steps, the assignment of the value specified by the variable binding's value field to the specified variable requires the allocation of a resource which is presently unavailable, then the value of the Response-PDU's error-status field is set to `resourceUnavailable', and the value of its error- index field is set to the index of the failed variable binding.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"(12) If the processing of the variable binding fails for a reason other than listed above, then the value of the Response-PDU's error- status field is set to `genErr', and the value of its error-index field is set to the index of the failed variable binding.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"(13) Otherwise, the validation of the variable binding succeeds.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"At the end of the first phase, if the validation of all variable bindings succeeded, then the value of the Response-PDU's error-status field is set to `noError' and the value of its error-index field is zero, and processing continues as follows.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"For each variable binding in the request, the named variable is created if necessary, and the specified value is assigned to it.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"Each of these variable assignments occurs as if simultaneously with respect to all other assignments specified in the same request.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"However, if the same variable is named more than once in a single request, with different associated values, then the actual assignment made to that variable is implementation-specific.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"If any of these assignments fail (even after all the previous validations), then all other assignments are undone, and the Response-PDU is modified to have the value of its error-status field set to `commitFailed', and the value of its error-index field set to the index of the failed variable binding.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"If and only if it is not possible to undo all the assignments, then the Response-PDU is modified to have the value of its error-status field set to `undoFailed', and the value of its error-index field is set to zero.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"Note that implementations are strongly encouraged to take all possible measures to avoid use of either `commitFailed' or `undoFailed' - these two error-status codes are not to be taken as license to take the easy way out in an implementation.\",\n            \"Adjusted\": \"No change\"\n        },\n        {\n            \"Original\": \"Finally, the generated Response-PDU is encapsulated into a message, and transmitted to the originator of the SetRequest-PDU.\",\n            \"Adjusted\": \"No change\"\n        }\n    ]\n}"
}